app/controllers/apparts_controller.rb

  def index
    if params[:query].blank?
      # blank? => méthode rails pour préciser que la valeur est vide
      # blank? fini par un ? => il s'agit donc d'une méthode retournant un booléen
      @apparts = Appart.all
---
SELECT "apparts".* FROM "apparts"

  def bien
    @appart = Appart.find(params[:id])
---
SELECT  "apparts".* FROM "apparts" WHERE "apparts"."id" = ? LIMIT 1  [["id", 1]]